layer {
  name: "data"
  type: "Python"
  top: "data"
  top: "label"
  python_param {
    module: "ImageLabelmapData"
    layer: "ImageLabelmapDataLayer"
    param_str: "{\'source\': \'bsds_pascal_train_pair.lst\', \'root\': \'/home/liang/rcf/data\', \'shuffle\': True, \'mean\': (104.00699, 116.66877, 122.67892)}"
  }
}
layer { name: "conv1_1" type: "Convolution" bottom: "data" top: "score"
  param { lr_mult: 0.01 decay_mult: 1 } param { lr_mult: 0.02 decay_mult: 0 }
  convolution_param { engine: CUDNN num_output: 1 kernel_size: 1
    weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }
layer{
  name: "loss"
  type: "EuclideanLoss"
  bottom: "score"
  bottom: "label"
}
