layer {
  name: "data"
  type: "Python"
  top: "data"
  top: "label"
  python_param {
    module: "ImageLabelmapData"
    layer: "ImageLabelmapDataLayer"
    param_str: "{\'source\': \'bsds_pascal_train_pair.lst\', \'root\': \'/home/liang/rcf/data/HED-BSDS\', \'shuffle\': True, \'mean\': (104.00699, 116.66877, 122.67892)}"
  }
}
layer {
  name: "conv1_1"
  type: "Convolution"
  bottom: "data"
  top: "conv1_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "relu1_1"
  type: "ReLU"
  bottom: "conv1_1"
  top: "conv1_1"
}
layer {
  name: "conv1_2"
  type: "Convolution"
  bottom: "conv1_1"
  top: "conv1_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "relu1_2"
  type: "ReLU"
  bottom: "conv1_2"
  top: "conv1_2"
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1_2"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv2_1"
  type: "Convolution"
  bottom: "pool1"
  top: "conv2_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "relu2_1"
  type: "ReLU"
  bottom: "conv2_1"
  top: "conv2_1"
}
layer {
  name: "conv2_2"
  type: "Convolution"
  bottom: "conv2_1"
  top: "conv2_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "relu2_2"
  type: "ReLU"
  bottom: "conv2_2"
  top: "conv2_2"
}
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "conv2_2"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv3_1"
  type: "Convolution"
  bottom: "pool2"
  top: "conv3_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "relu3_1"
  type: "ReLU"
  bottom: "conv3_1"
  top: "conv3_1"
}
layer {
  name: "conv3_2"
  type: "Convolution"
  bottom: "conv3_1"
  top: "conv3_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "relu3_2"
  type: "ReLU"
  bottom: "conv3_2"
  top: "conv3_2"
}
layer {
  name: "conv3_3"
  type: "Convolution"
  bottom: "conv3_2"
  top: "conv3_3"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "relu3_3"
  type: "ReLU"
  bottom: "conv3_3"
  top: "conv3_3"
}
layer {
  name: "pool3"
  type: "Pooling"
  bottom: "conv3_3"
  top: "pool3"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv4_1"
  type: "Convolution"
  bottom: "pool3"
  top: "conv4_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "relu4_1"
  type: "ReLU"
  bottom: "conv4_1"
  top: "conv4_1"
}
layer {
  name: "conv4_2"
  type: "Convolution"
  bottom: "conv4_1"
  top: "conv4_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "relu4_2"
  type: "ReLU"
  bottom: "conv4_2"
  top: "conv4_2"
}
layer {
  name: "conv4_3"
  type: "Convolution"
  bottom: "conv4_2"
  top: "conv4_3"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "relu4_3"
  type: "ReLU"
  bottom: "conv4_3"
  top: "conv4_3"
}
layer {
  name: "pool4"
  type: "Pooling"
  bottom: "conv4_3"
  top: "pool4"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv5_1"
  type: "Convolution"
  bottom: "pool4"
  top: "conv5_1"
  param {
    lr_mult: 100.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 200.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "relu5_1"
  type: "ReLU"
  bottom: "conv5_1"
  top: "conv5_1"
}
layer {
  name: "conv5_2"
  type: "Convolution"
  bottom: "conv5_1"
  top: "conv5_2"
  param {
    lr_mult: 100.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 200.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "relu5_2"
  type: "ReLU"
  bottom: "conv5_2"
  top: "conv5_2"
}
layer {
  name: "conv5_3"
  type: "Convolution"
  bottom: "conv5_2"
  top: "conv5_3"
  param {
    lr_mult: 100.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 200.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "relu5_3"
  type: "ReLU"
  bottom: "conv5_3"
  top: "conv5_3"
}
layer {
  name: "conv1_1_down"
  type: "Convolution"
  bottom: "conv1_1"
  top: "conv1_1_down"
  param {
    lr_mult: 0.00999999977648
    decay_mult: 1.0
  }
  param {
    lr_mult: 0.019999999553
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 1
    kernel_size: 1
    weight_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv1_2_down"
  type: "Convolution"
  bottom: "conv1_2"
  top: "conv1_2_down"
  param {
    lr_mult: 0.00999999977648
    decay_mult: 1.0
  }
  param {
    lr_mult: 0.019999999553
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 1
    kernel_size: 1
    weight_filler {
      type: "constant"
    }
  }
}
layer {
  name: "fuse1"
  type: "Eltwise"
  bottom: "conv1_1_down"
  bottom: "conv1_2_down"
  top: "fuse1"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "dsn1"
  type: "Convolution"
  bottom: "fuse1"
  top: "dsn1"
  param {
    lr_mult: 0.00999999977648
    decay_mult: 1.0
  }
  param {
    lr_mult: 0.019999999553
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 1
    kernel_size: 1
    weight_filler {
      type: "guassian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "dsn1_crop"
  type: "Crop"
  bottom: "dsn1"
  bottom: "data"
  top: "dsn1_crop"
  crop_param {
    axis: 2
    offset: 0
  }
}
layer {
  name: "dsn1_loss"
  type: "SigmoidCrossEntropyLoss"
  bottom: "dsn1_crop"
  bottom: "label"
  top: "dsn1_loss"
}
layer {
  name: "conv2_1_down"
  type: "Convolution"
  bottom: "conv2_1"
  top: "conv2_1_down"
  param {
    lr_mult: 0.00999999977648
    decay_mult: 1.0
  }
  param {
    lr_mult: 0.019999999553
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 1
    kernel_size: 1
    weight_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv2_2_down"
  type: "Convolution"
  bottom: "conv2_2"
  top: "conv2_2_down"
  param {
    lr_mult: 0.00999999977648
    decay_mult: 1.0
  }
  param {
    lr_mult: 0.019999999553
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 1
    kernel_size: 1
    weight_filler {
      type: "constant"
    }
  }
}
layer {
  name: "fuse2"
  type: "Eltwise"
  bottom: "conv2_1_down"
  bottom: "conv2_2_down"
  top: "fuse2"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "dsn2"
  type: "Convolution"
  bottom: "fuse2"
  top: "dsn2"
  param {
    lr_mult: 0.00999999977648
    decay_mult: 1.0
  }
  param {
    lr_mult: 0.019999999553
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 1
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "upsample2"
  type: "Deconvolution"
  bottom: "dsn2"
  top: "dsn2_up"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 1
    pad: 0
    kernel_size: 4
    stride: 2
    weight_filler {
      type: "bilinear"
    }
  }
}
layer {
  name: "dsn2_crop"
  type: "Crop"
  bottom: "dsn2_up"
  bottom: "data"
  top: "dsn2_crop"
  crop_param {
    axis: 2
    offset: 1
  }
}
layer {
  name: "dsn2_loss"
  type: "SigmoidCrossEntropyLoss"
  bottom: "dsn2_crop"
  bottom: "label"
  top: "dsn2_loss"
}
layer {
  name: "conv3_1_down"
  type: "Convolution"
  bottom: "conv3_1"
  top: "conv3_1_down"
  param {
    lr_mult: 0.00999999977648
    decay_mult: 1.0
  }
  param {
    lr_mult: 0.019999999553
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 1
    kernel_size: 1
    weight_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv3_2_down"
  type: "Convolution"
  bottom: "conv3_2"
  top: "conv3_2_down"
  param {
    lr_mult: 0.00999999977648
    decay_mult: 1.0
  }
  param {
    lr_mult: 0.019999999553
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 1
    kernel_size: 1
    weight_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv3_3_down"
  type: "Convolution"
  bottom: "conv3_3"
  top: "conv3_3_down"
  param {
    lr_mult: 0.00999999977648
    decay_mult: 1.0
  }
  param {
    lr_mult: 0.019999999553
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 1
    kernel_size: 1
    weight_filler {
      type: "constant"
    }
  }
}
layer {
  name: "fuse3"
  type: "Eltwise"
  bottom: "conv3_1_down"
  bottom: "conv3_2_down"
  bottom: "conv3_3_down"
  top: "fuse3"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "dsn3"
  type: "Convolution"
  bottom: "fuse3"
  top: "dsn3"
  param {
    lr_mult: 0.00999999977648
    decay_mult: 1.0
  }
  param {
    lr_mult: 0.019999999553
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 1
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "upsample4"
  type: "Deconvolution"
  bottom: "dsn3"
  top: "dsn3_up"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 1
    pad: 1
    kernel_size: 8
    stride: 4
    weight_filler {
      type: "bilinear"
    }
  }
}
layer {
  name: "dsn3_crop"
  type: "Crop"
  bottom: "dsn3_up"
  bottom: "data"
  top: "dsn3_crop"
  crop_param {
    axis: 2
    offset: 1
  }
}
layer {
  name: "dsn3_loss"
  type: "SigmoidCrossEntropyLoss"
  bottom: "dsn3_crop"
  bottom: "label"
  top: "dsn3_loss"
}
layer {
  name: "conv4_1_down"
  type: "Convolution"
  bottom: "conv4_1"
  top: "conv4_1_down"
  param {
    lr_mult: 0.00999999977648
    decay_mult: 1.0
  }
  param {
    lr_mult: 0.019999999553
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 1
    kernel_size: 1
    weight_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv4_2_down"
  type: "Convolution"
  bottom: "conv4_2"
  top: "conv4_2_down"
  param {
    lr_mult: 0.00999999977648
    decay_mult: 1.0
  }
  param {
    lr_mult: 0.019999999553
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 1
    kernel_size: 1
    weight_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv4_3_down"
  type: "Convolution"
  bottom: "conv4_3"
  top: "conv4_3_down"
  param {
    lr_mult: 0.00999999977648
    decay_mult: 1.0
  }
  param {
    lr_mult: 0.019999999553
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 1
    kernel_size: 1
    weight_filler {
      type: "constant"
    }
  }
}
layer {
  name: "fuse4"
  type: "Eltwise"
  bottom: "conv4_1_down"
  bottom: "conv4_2_down"
  bottom: "conv4_3_down"
  top: "fuse4"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "dsn4"
  type: "Convolution"
  bottom: "fuse4"
  top: "dsn4"
  param {
    lr_mult: 0.00999999977648
    decay_mult: 1.0
  }
  param {
    lr_mult: 0.019999999553
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 1
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "upsample8"
  type: "Deconvolution"
  bottom: "dsn4"
  top: "dsn4_up"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 1
    pad: 3
    kernel_size: 16
    stride: 8
    weight_filler {
      type: "bilinear"
    }
  }
}
layer {
  name: "dsn4_crop"
  type: "Crop"
  bottom: "dsn4_up"
  bottom: "data"
  top: "dsn4_crop"
  crop_param {
    axis: 2
    offset: 1
  }
}
layer {
  name: "dsn4_loss"
  type: "SigmoidCrossEntropyLoss"
  bottom: "dsn4_crop"
  bottom: "label"
  top: "dsn4_loss"
}
layer {
  name: "conv5_1_down"
  type: "Convolution"
  bottom: "conv5_1"
  top: "conv5_1_down"
  param {
    lr_mult: 0.00999999977648
    decay_mult: 1.0
  }
  param {
    lr_mult: 0.019999999553
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 1
    kernel_size: 1
    weight_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv5_2_down"
  type: "Convolution"
  bottom: "conv5_2"
  top: "conv5_2_down"
  param {
    lr_mult: 0.00999999977648
    decay_mult: 1.0
  }
  param {
    lr_mult: 0.019999999553
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 1
    kernel_size: 1
    weight_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv5_3_down"
  type: "Convolution"
  bottom: "conv5_3"
  top: "conv5_3_down"
  param {
    lr_mult: 0.00999999977648
    decay_mult: 1.0
  }
  param {
    lr_mult: 0.019999999553
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 1
    kernel_size: 1
    weight_filler {
      type: "constant"
    }
  }
}
layer {
  name: "fuse5"
  type: "Eltwise"
  bottom: "conv5_1_down"
  bottom: "conv5_2_down"
  bottom: "conv5_3_down"
  top: "fuse5"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "dsn5"
  type: "Convolution"
  bottom: "fuse5"
  top: "dsn5"
  param {
    lr_mult: 0.00999999977648
    decay_mult: 1.0
  }
  param {
    lr_mult: 0.019999999553
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 1
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "upsample16"
  type: "Deconvolution"
  bottom: "dsn5"
  top: "dsn5_up"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 1
    pad: 7
    kernel_size: 32
    stride: 16
    weight_filler {
      type: "bilinear"
    }
  }
}
layer {
  name: "dsn5_crop"
  type: "Crop"
  bottom: "dsn5_up"
  bottom: "data"
  top: "dsn5_crop"
  crop_param {
    axis: 2
    offset: 1
  }
}
layer {
  name: "dsn5_loss"
  type: "SigmoidCrossEntropyLoss"
  bottom: "dsn5_crop"
  bottom: "label"
  top: "dsn5_loss"
}
layer {
  name: "concat"
  type: "Concat"
  bottom: "dsn1_crop"
  bottom: "dsn2_crop"
  bottom: "dsn3_crop"
  bottom: "dsn4_crop"
  bottom: "dsn5_crop"
  top: "concat_5"
  concat_param {
    concat_dim: 1
  }
}
layer {
  name: "dsn"
  type: "Convolution"
  bottom: "concat_5"
  top: "dsn"
  param {
    lr_mult: 0.0010000000475
    decay_mult: 1.0
  }
  param {
    lr_mult: 0.00200000009499
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 1
    kernel_size: 1
    weight_filler {
      type: "constant"
      value: 0.20000000298
    }
  }
}
layer {
  name: "fuse_loss"
  type: "SigmoidCrossEntropyLoss"
  bottom: "dsn"
  bottom: "label"
  top: "fuse_loss"
}
